
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.fixed_secrets[&#34;er-portal-jwtTTL&#34;]
  * azurerm_key_vault_secret.stored[&#34;er-portal-jwtKey&#34;]
  * azurerm_key_vault_secret.stored[&#34;er-portal-sessionSecret&#34;]
  * azurerm_key_vault_secret.stored3[&#34;jwtNoAuthKey&#34;]
  * azurerm_key_vault_secret.stored64[&#34;er-portal-jwtKey&#34;]
  * random_password.generated[&#34;er-portal-jwtKey&#34;]
  * random_password.generated[&#34;er-portal-sessionSecret&#34;]
* Replace
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.fixed_secrets["er-portal-jwtTTL"] will be created
  + resource "azurerm_key_vault_secret" "fixed_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/juror-prod-rg/providers/Microsoft.KeyVault/vaults/juror-prod"
      + name                    = "er-portal-jwtTTL"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored["er-portal-jwtKey"] will be created
  + resource "azurerm_key_vault_secret" "stored" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/juror-prod-rg/providers/Microsoft.KeyVault/vaults/juror-prod"
      + name                    = "er-portal-jwtKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored["er-portal-sessionSecret"] will be created
  + resource "azurerm_key_vault_secret" "stored" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/juror-prod-rg/providers/Microsoft.KeyVault/vaults/juror-prod"
      + name                    = "er-portal-sessionSecret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored3["jwtNoAuthKey"] will be created
  + resource "azurerm_key_vault_secret" "stored3" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/juror-prod-rg/providers/Microsoft.KeyVault/vaults/juror-prod"
      + name                    = "er-portal-jwtNoAuthKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored64["er-portal-jwtKey"] will be created
  + resource "azurerm_key_vault_secret" "stored64" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/juror-prod-rg/providers/Microsoft.KeyVault/vaults/juror-prod"
      + name                    = "api-JWT-SECRET-ER-PORTAL"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # random_password.generated["er-portal-jwtKey"] will be created
  + resource "random_password" "generated" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.generated["er-portal-sessionSecret"] will be created
  + resource "random_password" "generated" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] must be replaced
-/+ resource "azurerm_monitor_activity_log_alert" "main" {
      ~ id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/juror-prod-rg/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - juror-prod" -> (known after apply)
      ~ name                = "Application Insights daily cap reached - juror-prod" -> "Application-Insights-daily-cap-reached-juror-prod" # forces replacement
        tags                = {
            "application"         = "juror"
            "builtFrom"           = "https://github.com/HMCTS/juror-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#juror-dev"
            "environment"         = "production"
            "managedBy"           = "Juror"
        }
        # (5 unchanged attributes hidden)

      ~ criteria {
          - levels                  = [] -> null
          - resource_groups         = [] -> null
          - resource_ids            = [] -> null
          - resource_providers      = [] -> null
          - resource_types          = [] -> null
          - statuses                = [] -> null
          - sub_statuses            = [] -> null
            # (13 unchanged attributes hidden)

          ~ resource_health (known after apply)

          ~ service_health (known after apply)
        }

        # (1 unchanged block hidden)
    }

Plan: 8 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":68,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->